Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 有那佛家的行者，在凄厉风雨夜，赤足托钵而行，唱着佛号，步伐坚定。有赴京赶考的穷书生，在破败古寺里，为披着人皮的狐魅温柔画眉，最后重新动身启程之时，哪怕明知自己已是两鬓微霜，也无悔恨。
en_us: There was that Buddhist monk who walked barefoot during windy and rainy nights to ask for food, with his steps firm and resolute as he continued to chant the Buddha's name. There was that impoverished scholar who was rushing to the capital to take the imperial exam, not remorseful or resentful that the hair by his temples had greyed after staying in that rundown temple and gently helping that fox spirit in human form draw her eyebrows...

source: 有钱人家就是讲究多，卢家宅子大不说，门口还摆放两尊石狮子，等人高，气势凌人。宋集薪说这玩意儿能够避凶镇邪，陈平安根本不清楚何谓凶邪，只是很好奇等人高的狮子嘴里，好像还含着一粒圆滚滚的石球，这又是如何雕琢出来的？陈平安强忍住去触摸石球的冲动，走上台阶，扣响那个青铜狮子门首，很快就有个年轻人开门走出，一听说是来送信的，那人面无表情，用双指捻住信封一角，接过那封家书后，便转身快步走入宅子，重重关上贴有彩绘财神像的大门。
en_us: Wealthy clans were very particular about many things. Not only was the Lu Manor massive, there were two stone lions placed on either side of the entrance, both of which were as tall as a grown man, presenting a rather intimidating sight to behold. According to Song Jixin, these things were capable of warding off malicious and evil entities. Chen Ping'an had no idea what these malicious and evil entities were supposed to be. He was only very intrigued by the round stond ball that each of the stone lions held in their mouths, wondering how those balls had been sculpted. He forcibly suppressed the urge to touch those stone balls, then made his way up the steps before using the bronze lion head knockers on the doors. A young man quickly made his way out of the manor, and upon hearing that Chen Ping'an was here to deliver a letter, the man pinched a corner of the letter between two of his fingers and took it from Chen Ping'an in an expressionless manner. He then quickly strode back into the manor before closing the doors, which bore a colorful visage of the god of wealth.

source: 有顶着天师头衔的年轻道人，在古战场和乱葬岗之中独自穿行，默念着福生无量天尊，不惜消耗自身修为，为孤魂野鬼们引领一条超脱之路。有上任之初亲手禁绝淫祠龙王庙的中年文官，嘴唇干裂渗出血丝，在干涸河床边上，摆下香案，沙哑诵读着《龙王祈雨文》，最后为了辖境内的百姓，面向龙王庙，下跪请罪。
en_us: There was that young Daoist who held the esteemed title of Heavenly Master, walking through the unmarked graves of that ancient battle field alone as he silently recited the mantra "Protection of the Myriad Heavenly Venerates", not hesitating to sacrifice his cultivation to point out a path for those lost and lonesome ghosts. There was that middle-aged official who had personally sealed off an illegal Dragon King Temple early in his career, yet his lips were cracked and bloody as he placed an incense table by the dry riverbed and recited the Dragon King Rain Seeking Script with a hoarse voice, even going as far as to face the direction of the Dragon King Temple and drop to his knees to kowtow for forgiveness, all for the sake of the commoners in his jurisdiction.

source: 木讷少年手持石头，站在一块露出水面的石头上，如同顶天立地的仙人，手持一轮袖珍圆月。
en_us: Holding the pebble in his hand, the expressionless young boy stood on a rock that was exposed above the water's surface. At this moment, he looked like a mighty immortal who was holding a full moon in his hand.

source: 末代王朝，山河破碎，必有神兵重器出世，以迎新王朝新气象。
en_us: Throughout history, the fall of each empire had always entailed the emergence of extremely powerful treasures to welcome the rise of a new empire.

source: 本名王朱的少女，笑不露齿。
en_us: The young girl, who's orginal name was Wang Zhu, wore a discreet smile.

source: 本名阮邛的男人挑了张凳子坐下，握住高大少年的手腕，一团乱麻的脉象，糟糕至极。本就心情不太好的汉子愈发脸色阴沉，大发牢骚道：“齐静春也真是的，正阳山如此投机行事，就算没办法按照规矩，将其驱逐出境，好歹也给点教训，杀鸡儆猴，即便杀不得，打几下有什么问题？要不然接下来此方天地不断有新人涌入，更加鱼龙混杂，还不得乱套？怎么，是想着反正没几天就要卸任，大不了就留给我一个稀巴烂的摊子？说好的读书人的担当呢”
en_us: Master Ruan took a seat on a chair, then laid his fingertips onto Liu Xianyang's wrist to check his pulse, only to find that it was in a state of complete chaos and disarray. He was already in a bad mood, and this only served to worsen his mood even further. He couldn't help but grumble to himself, "Qi Jingchun really needs to pull his weight! Given how close the Sun Scorch Mountain has come to breaking the rules, even if he can't evict them from the town, he should at least teach them a lesson and make an example out of them. He can't kill them, but it certainly wouldn't hurt to give them a beating! From here onward, more and more outsiders will continue to flock to the town, and if no example is set, things are only going to get even more chaotic. Is he thinking that he's going to be off duty soon, so he's just going to leave this mess for me to clean up? Aren't scholars supposed to be more considerate and responsible than that?"

source: 本就伤势不轻的少女不忍心去看，那一刻，她有些绝望，艰难握住剑柄，当一条手臂支撑不住之时，赶紧换手握剑，如此反复，不断减缓下坠速度。
en_us: The heavily wounded young girl couldn't bring herself to look over. At this moment, she felt a slight sense of despair. She held onto her sword with much difficulty, and when one arm became too tired, she would hurriedly switch to the other arm. She did this again and again, slowing herself down as she fell to the ground.

source: 本想追击的老猿有些莫名其妙，生怕有诈，便继续慢步前行，打定主意静观其变。
en_us: Bai Yuan, who was just about to attack her, couldn't help but find this odd. Afraid that there was a trap, he continued to advance in a slow and cautious manner, keeping his eyes peeled for any sudden changes.

source: 杂草丛生，狐兔出没，孤苦伶仃，一树独茂。
en_us: Weeds growing everywhere, foxes and rabbits hopping around, lonely and helpless, and single tree sprouting...

source: 李宝瓶也朝他挥了挥拳头，示意自己会努力的。
en_us: Li Baoping waved her little fist at him in response as a silent promise that she would indeed do her best.

source: 李宝瓶只好先放过石春嘉，满脸失望，一起走进大门的时候，还不忘替石春嘉感到可惜。
en_us: Thus, Li Baoping had no choice but to let Shi Chunjia off the hook for now. She was very disappointed, and even as she made her way into the manor, she was still feeling quite forlorn on Shi Chunjia's behalf.

source: 李宝瓶并没有觉得丢人现眼，而是一本正经道：“我事后反省了，那次是我落地姿势不对，不该直不隆冬双脚戳下去的，所以等我腿好了之后，我再去试就”
en_us: Li Baoping didn't think this was an embarrassing story at all, and she said in a serious manner, "I thought long and hard about what happened, and I realized that my landing position was incorrect. I shouldn't have just jumped straight down and had my legs bear the full impact. I went to try again after my legs were all healed up and..."

source: 李宝瓶拆台道：“你喊她小石头就行了。”
en_us: "You can just call her Little Rock," Li Baoping scoffed. [ref]Shi Chunjia's surname (石) translates to rock/stone.[/ref]

source: 李宝瓶撇撇嘴，“第三次不就没事了。”
en_us: "I was fine the third time, wasn't I?" Li Baoping countered in a justified manner.

source: 李宝瓶正在吃力地换肩膀来扛槐枝，之前已经来回换过很多次，火辣辣的疼。
en_us: Meanwhile, Li Baoping was arduously moving her locust branch to her other shoulder. She had already transfered the branch back and forth from shoulder to shoulder many times, and both of her shoulders were feeling very sore.

source: 李宝瓶眼尖，看到了坐在树墩子上的陈平安，以迅雷不及掩耳之势跳下牛车，踉跄了一下，飞快跑到陈平安身前，猛然站定，却又好像不知道该说什么，最后只挺起胸膛，说了一句“我要去很远很远的地方”，小脸上满是骄傲。
en_us: Li Baoping had a pair of sharp eyes, and she quickly spotted Chen Ping'an sitting on the tree stump. She immediately jumped down from the ox-drawn carriage like lightning, stumbling slightly before rushing over to Chen Ping'an like the wind, only to abruptly stop in front of him, seemingly unsure of what to say. In the end, she puffed out her chest with a proud expression and declared, "I'm going somewhere really, really far away."

source: 李宝瓶突然惊讶出声，抬着头。
en_us: All of a sudden, a surprised look appeared on Li Baoping's face as she looked up at the sky.

source: 李宝瓶突然走到石春嘉身后，双手握住她的两根羊角辫，准备往上提，“相信我，这次肯定行。”
en_us: All of a sudden, Li Baoping made her way behind Shi Chunjia, then grabbed onto her braids before preparing to lift her upward. "Trust me, it'll definitely work this time."

source: 李宝瓶蹲在比自己矮小一圈的她身边，自信满满道：“小石头，不疼的，你没有试过第二次，怎么知道不行呢？对不对？”
en_us: Li Baoping was quite a bit taller than Shi Chunjia, and she squatted down beside her as she declared in a confident voice, "It won't hurt at all, Little Rock. How will you know if you don't try it a second time?"

source: 李家大宅，那个来自正阳山的小女孩，作为陶家老祖的嫡孙女，被李家上上下下当菩萨供奉起来， 李家除了在别院安排了多位一二等丫鬟，这些身为家生子的少女，手脚干净利索，最重要的是知根知底，身世清白，可能从祖辈起就对李家忠诚不二。
en_us: The little girl from the Sun Scorch Mountain was a direct lineal granddaughter to the Tao Clan's patriarch, and she was revered like the Bodhisattva by everyone in the entire Li Clan's manor. Not only were the maidservants that had been sent to serve the little girl the best that the Li Clan had to offer, all of them had been born in the manor and trained to become maidservants from birth. Hence, they were all very good at their job, and most importantly, they were absolutely trustworthy, with most of them hailing from a line of servants that had already served the Li Clan for generations.

source: 李家的红棉袄小女孩，赶紧躲在神仙姐姐身后。
en_us: The little girl from the Li Clan hurriedly hid behind her Daoist sister.

source: 李槐年纪不大，嘴巴很刁，不忘火上浇油，老气横秋道：“老马啊，李宝瓶这种顽劣学生，一定要好好管束才行，要不然成不了材的。既然齐先生不在了，老马你就要挑起担子来”
en_us: Li Huai was only a young boy, but he was already an extremely sly character, and he continued to try and condemn Li Baoping. "Old Man Ma, you have to be more strict with bad students like her. Otherwise, she's never going to amount to anything. Now that Mr. Qi isn't here anymore, you have to pick up the slack and..."

source: 李氏家主刚要落下的心，立即重新悬到嗓子眼。
en_us: Li Hong was initially quite relieved to hear what Tao Zi had to say, only for his heart to leap back into his throat again.

source: 李氏家主轻声道：“前辈放心，我们李氏一定将陶小姐安然无恙地送出小镇。”
en_us: The leader of the Li Clan said in a low voice, "Rest Assured, Senior Yuan, our Li Clan will be sure to deliver Young Mistress Tao out of the two safe and sound."

source: 李氏家主连忙作揖致歉，惶恐不安道：“猿老祖这是折煞李家啊。”
en_us: Li Hong hurriedly extended an apologetic bow as he said in a fearful manner, "I'll be sure to carry our your instructions, Patriarch Yuan!"

source: 杏花巷有口水井，名叫铁锁井，一根粗如青壮手臂的铁链，年复一年，垂挂于井口内，何时有此水井有此铁锁，又是何人做此无聊事奇怪事，早已无人知晓真相，就连小镇岁数最大的老人，也说不出个子丑寅卯来。
en_us: There was a well in Apricot Blossom Alley by the name of Iron Lock Well. A metal chain that was as thick as a young man's arm was dangling down inside the well, and no one knew why the chain was there, nor who had done something as strange and pointless as hanging a chain in the well. Even the oldest individuals in the town were unable to provide any accounts.

source: 杏花巷深处一栋大宅子，从内到外收拾得干干净净，甚至连院门口的道路，也比别人家门口整洁许多。
en_us: This was a large residence deep in Apricot Blossom Alley. It was clean and tidy from the outside to the inside, and even the path in front of the courtyard gate was cleaner than those of its neighbors.

source: 杏花巷那边，有个木讷男子蹲在铁锁井旁边，盯着那根绑死在轱辘车底座上的铁链。
en_us: Over on Apricot Blossom Alley, there was a prudent middle-aged man who was crouched down beside the Iron Lock Well, staring intently at the metal chain tied t othe underside of the well winch, as if he were considering how to carry the chain away with him.

source: 杏花巷马家祖宅，逛遍小镇的金甲神人走回院子，奇怪的是这么大一尊真神，行走四方，竟然无人察觉。
en_us: In the Ma Family's residence in Apricot Blossom Alley... The deity in golden armor returned to the courtyard after searching through the entire town. Strangely, however, no one had noticed it as it had walked through the streets and alleys.

source: 杏花巷，一个孩子又蹲在糖葫芦摊子不远处，每次都蹲一会儿，时间不久，但让摊子主人记得了那张黝黑小脸庞。
en_us: On Apricot Blossom Alley, a boy was once again squatting down not far away from a tanghulu stall. He would always do this whenever he passed by, and he never lingered for very long, but it was still enough for the stall owner to remember his tanned little face.

source: 条南北向的僻静小巷，唯有车轱辘声。
en_us: There was a peaceful alley in the town that led from the north to the south, and only the sound of rolling cart wheels could be heard.

source: 来此小镇，每位选定之人，可携带三枚信物，分别装入锦囊绣袋，之前交给看门人一只袋子，属于必须掏出来的过路费，不管那个看门人身份高低，不论城门如何破烂不堪，即便是一国君主，或者一宗祖师来此，也得老老实实按照这个规矩来。其余两只锦囊绣袋，意思是在此最多捞取两件宝物带出小镇，否则任你在这里搜刮到十件、百件宝贝，也要一一还回去。袋子里的信物，是三种形制特殊的铜钱，分别是市井百姓用以庆贺上梁的压胜钱，皇宫每年悬挂于桃符上的迎春钱，以及被城隍爷塑像托在掌心的供养钱，说是铜钱，其实质地是珍稀异常的金精，对于“山下”大多数凡夫俗子而言，连官家纹银都不常见，更何况是一袋子沉甸甸的“黄金”，确实足以让人心甘情愿来兜售传家宝。
en_us: For those who had been selected to come to the town, each of them carried three tokens that were placed in embroidered pouches. One of those pouches contained the toll that had to be given to the gatekeeper in order to be granted access into the town. Regardless of the status of the gatekeeper, regardless of the condition of the town gate, even the ruler of a nation or the founder of a sect had to follow this rule upon coming here. The other two embroidered pouches signified that each of them was only permitted to take a maximum of two treasures to be taken out of the town. Outside of the maximum allotted quota of two treasure, regardless of whether one managed to collect 10 treasures, or even 100, every single one of them had to be returned. The tokens in the pouches consisted of three special types of copper coins, one of which was used by the common folk to celebrate beam raising ceremonies, another was hung upwith the peach talismans in the imperial palace each year to welcome the arrival of spring, and the final type of coin was offered up to be placed on the palms of city god statues. These three types of coins were all referred to as copper coins, but in reality, they had been minted using gold essence, which was an extremely precious material. For teh majority of the town's residents, even official silver was a very rare sight, let alone hefty bags of gold, so it was no wonder that these people were willing to sell their clans' prized treasures, some of which had already been passed down for gernerations.

source: 来者正是观湖书院最大的读书种子，崔明皇，他应该会是最后一位离开此地的外乡人。
en_us: The man who had just arrived was none other than the most studious scholar of Lake View Academy, Cui Minghuang. He was most likely going to be the final outsider to leave this town.

source: 杨家铺子后院的老杨头，坐在油灯旁打着盹，惊醒后，用老烟杆磕了磕桌面。
en_us: Sitting next to an oil lamp in the Yang Family's medicine shop, Old Man Yang was suddenly roused from his nap. He tapped the table with his tobacco pipe.

source: 杨家铺子后院，独自一人的老人收起烟杆，挥了挥手，把身边那些烟雾驱散后，说道：“放心，事成之后，答应会给你一个河婆的不朽之身，至于将来能否真正成就神位真身，提拔为一方江水正神，得看你自己的造化。”
en_us: Alone in the backyard of the Yang Family's medicine shop, Old Man Yang put away his smoking pipe and waved his hand, dispelling the cloud of smoke around him. "Rest assured, I'll grant you the indestructible body of a river guardian when you succeed. As for whether you can become a genuine river god or not, that will be up to your own abilities and fortune."

source: 杨家铺子正堂后门那边，郑大风大笑喊着，急急忙忙来报喜。
en_us: Near the backdoor of the Yang Family's medicine shop, Zheng Dafeng was laughing and shouting as he hurriedly rushed over to deliver some good news.

source: 杨家铺子的老掌柜回到小镇后，直奔自家铺子后边的院子，不大不小，正好够店里三位长工伙计居住。
en_us: After returning to the town, Shopkeeper Yang headed straight for the courtyard behind his shop, an area that was a perfect size for the shop's three long-term employees to live at.

source: 杨家铺子的老掌柜，其实一直竖着耳朵偷听，闻言后顿时拜服，心想不愧是下一任坐镇洞天的圣人，这脸皮都能挡下飞剑了。
en_us: Shopkeeper Yang had been eavesdropping on Ruan Qiong this entire time, and he was instantly stunned by how shameless Master Ruan was, thinking to himself, qhweitoewqthewihtioethwiehtoiewhoithewtoiewqhtoewqhtiewhtwth As expected of the next Sage to take over this place, his skin must be thick enough to keep out flying swords!

source: 杨家铺子老掌柜叹息道：“若是槐叶主人自己遭此重创，然后承受槐叶的祖荫，当然是救活的机会有五成，可是用来给别人消受福荫，就另当别论了。”
en_us: The old shopkeeper sighed, "If the owner of the locust leaf was the one to have suffered these injuries, there would be a roughly 50% chance that they would be able to survive thanks to their ancestral blessings. However, when this blessing is being offered to someone else, then it's an entirely different story."

source: 杨家铺子，一个隔三岔五就来买药的小孩子，这一天被一名不耐烦的店伙计推搡出铺子，那年轻伙计骂道：“跟你说过多少次了，这么几粒碎银子，连药渣子也买不了！哪有你这么烦人的，能堵在这里大半天的，我们这是药铺，要做生意的，不是寺庙，没有菩萨让你拜！你年纪小，老子真要动手打人了，滚滚滚！”
en_us: Not long after that, a boy began to make frequent visits to the Yang Family's medicine shop to buy medicinal ingredients. One day, a shop employee finally ran out of patience with him, and he pushed the boy out of the shop as he yelled, "How many times do I need to tell you this? You don't have enough money to buy even medicinal dregs! Are you stupid or deaf? Not only do you not have enough money to buy medicine, you're blocking the way for other people trying to enter the shop! This is a shop, not a charity! We have to make money! I've been patient with you all this time because you're just a kid, but if you keep bothering me, I'm going to beat you! Now piss off!"

source: 杨家铺子，有位英气少女背着少年快步跨过门槛，对一位中年店伙计问道：“杨老先生在不在？”
en_us: In the Yang Family's medicine shop, a young girl with a gallant disposition walked briskly inside as she carried a young boy on her back. She looked at a middle-aged shop assistant and asked, "Is Mr. Yang here?"

source: 杨老头不紧不慢地站起身，一手负后，一手持烟杆，来到少女身前，与少年对视，沙哑道：“与你说过多少次了，越是命贱福薄，就越要惜命惜福，怎么，稍稍遇到一些挫折，就要死要活，那你怎么当初不跟着你娘亲一起走，岂不是更省事一些？你姚师傅是对的，他生前总念叨三岁看老三岁看老，你是个活不长久的，哪怕教了你好手艺真功夫，也是浪费，一样要早早丢到土里去。”
en_us: Old Man Yao calmly stood up, with one hand behind his back and one hand holding his smoking pipe as he walked up to Ning Yao. He looked Chen Ping'an in the eyes and said in a hoarse voice, "How many times have I told you? The cheaper your life and the lesser your fortune, the more you have to cherish your life and cherish your fortune. So what do you do? Every time you encounter a minor setback, you push yourself until you're on the brink of death. Since you like doing this so much, why didn't you follow after your mother at that time? Wouldn't that save you the trouble? "Old Man Yao was correct. When he was alive, he always liked to say that a person's fate could be seen when they were only three-years-old. And you were one who wouldn't live for long. That being the case, teaching you the best skills and most profound arts would naturally be a waste. You'll still be six feet under very soon, after all."

source: 杨老头不耐烦道：“去去去，你小子还不够格与我谈，换成你们山主还差不多。”
en_us: Old Man Yang was beginning to lose his patience, and he chided, "Get out of here! You're not worthy of speaking to me. Get your mountain master to come here, and maybe then, I'll be open to a chat."

source: 杨老头也不催促，笑道：“烂泥里躺着其实也蛮舒服的，对不对，为什么要别人扶起来，对不对？”
en_us: Old Man Yang didn't try to rush her, smiling as he continued, "Then again, it's quite comfortable to just lay in mud and do nothing, isn't it? Why strive for higher aspirations?"

source: 杨老头依然保持原先的坐姿，头也不转，冷笑道：“河婆，和河神，一字之差，云泥之别。你这种读书人，会不懂？”
en_us: Old Man Yang remained seated, and he didn't even bother to turn around as he sneered, "The difference between a river guardian and a river god is night and day. Don't tell me that a scholar like yourself is unaware of the difference."

source: 杨老头冷漠道：“我不是来兴师问罪的，你以后也一样，只需要做力所能及的事情，不含糊，就可以了。不过现在有一个千载难逢的机会，摆在你面前，就看你自己敢不敢争取了。”
en_us: A cold look appeared on Old Man Yang's face as he said, "I'm not here to punish you. From now on, just make sure to do everything within the realm of your capabilities, that'll suffice. I came here because I have an extremely rare opportunity for you, and it's up to you whether you dare to fight for it or not."

source: 杨老头勃然大怒。
en_us: Old Man Yang was furious.

source: 杨老头叹了口气，赶紧起身走出屋子，关上门，站在台阶上，看着那位摆出兴师问罪架势的妇人，老人连抽旱烟的兴致也没了。
en_us: Old Man Yang sighed, and he hurriedly walked out of the building and shut the door behind him. He stood on the steps and looked at the woman who was about to raise hell. At this moment, he even lost interest in his smoking pipe.

source: 杨老头吐出一口烟雾，“你这话，也就只能跟我唠叨，要不然传出去，你这辈子也别想当书院山主。看在你先说了几句心里话的份上，咱们随便聊聊？”
en_us: Old Man Yang blew out a cloud of smoke as he mused, "You can only say something like this to me. If people on the outside heard what you just said, you can say goodbye to any chance of you becoming a mountain master of your academy in this lifetime. Seeing as you're willing to be so candid with me, I suppose I'm open to a chat."

source: 杨老头呵呵笑着，皮笑肉不笑。
en_us: Old Man Yang merely gave a cold smile and offered no response.

source: 杨老头嗤笑道：“就这？”
en_us: "That's all?" Old Man Yang sneered.

source: 杨老头嗯了一声，没有拒人千里之外。
en_us: Old Man Yang nodded in response, refraining from giving a verdict.

source: 杨老头回到原位坐着，望向屋外渐渐壮大的雨幕，急骤雨点敲在院落地面上，噼里啪啦作响，老人神色有些伤感，“这么多年过去了，挑来选去，找了那么多人，不曾想反倒是最不抱希望的一个，命最硬。”
en_us: Old Man Yang returned to his seat and looked out at the increasingly heavy rain. The frantic raindrops pitter-pattered against the courtyard floor. His expression became slightly sad, and he murmured, "After so many years of picking and choosing between so many people, who would've thought that the least hopeful candidate would have the most resilient life?"

source: 杨老头对此见怪不怪，又抽起了旱烟，问道：“你看出了什么？”
en_us: Old Man Yang wasn't surprised, and he took a puff from his smoking pipe as he asked, "Did you observe anything interesting?"

source: 杨老头怒道：“你家到底谁做主？！”
en_us: "Who's the decision-maker in your household?!" Old Man Yang scolded angrily.

source: 杨老头想了想，“你的本事我不清楚，不过你家先生，就凭他敢说出那四个字，在我眼中就能算这个。”
en_us: Old Man Yang thought for a moment before remarking, "I'm not sure about your abilities, but the fact that your master dared to say those four words... In my eyes, he can be regarded as this."

source: 杨老头感慨道：“齐静春那位先生之前的一位儒家圣人，说‘圣人竭尽目力，以规矩准绳，以为方圆平直’，意思是什么呢，简单说来就是你们这些老百姓啊，要感恩至圣先师的大恩大德，是他老人家花了老大气力，穷尽目力，才订立下这些规矩框架，以供后人在其中行走，不遭灾厄横祸，下辈子才有继续投胎做人的机会。”
en_us: Old Man Yang sighed with emotion, continuing, "The Confucian Sage above Qi Jingchun's master said this — 'Sages have exhausted their vision to create the compass, rulers, and guidelines, giving us an abundant supply of such tools'. What does this mean? "To put it simply, it means that the commoners need to be grateful to parmount Sage Confucius for his benevolence and good deeds. It was his great efforts and exhaustive work that created the scaffold for the rules and regulations today. At the same time, it's also these rules and regulations that allow the future generations to walk on the correct path and avoid calamity and disaster, thereby allowing them to reincarnate as humans again in their next life."

source: 杨老头扭头望去，仔仔细细打量了一下少女，最后冒出一句话来，“那道城墙上，如今刻下多少个字了？”
en_us: Old Man Yang turned around and carefully examined the young girl. In the end, he asked, "How many characters are inscribed on that wall now?"

source: 杨老头扯了扯嘴角，说道：“既然身为河婆，就要负责所有河中事务，既是为自己积攒阴德，也要为自己赢得一方水土的百姓香火。你若是能够让人为你建立祠庙，塑造金身，使得一缕分身立于其中，那就是你的本事，在这之后，就要争取让朝廷容纳你，跻身一国之内山岳江河的正统谱牒，得一个官方认可的身份，做不到的话，最少也要被载入地方县志。要是供奉你的祠庙，最后被当做一座淫祠，给官府奉命铲除，金身推倒，那你的日子就不好过了，比孤魂野鬼还难受。”
en_us: Old Man Yang pursed his lips and continued, "Since you're a river guardian now, you naturally need to be responsible for all the things that happen in your river. This is not only to accumulate hidden virtue[ref]This is referring to building good karma or fortune by perfoming good deeds without attracting attention[/ref], but also to obtain prayers and incense from the common people in the surrounding land. "If you're able to perform well and have someone build a temple and cast a golden statue for you, you'll be able to house a wisp of your spirit there to enjoy the people's worship. That will be up to your own ability. Afterward, you'll need to strive to have the imperial court acknowledge and accept you, and that will allow you to enter the official genealogical records of the empire. You'll be recognized as an official guardian of the mountains or waters. Failing this, however, you need to strive to at least enter the local county chronicles. "Otherwise, if your temple is categorized as an illegal one and demolished along with your golden statue, your days will become much tougher than they are now. You'll suffer even more than lonely spirits and wandering ghosts."

source: 杨老头抬头看了眼天空，视线透过三层天地，老人默不作声。
en_us: Old Man Yang gazed up at the sky, his vision penetrating through three layers of heaven and earth. He didn't respond to his disciple's question.
